Hi @edwardmedia,
Thanks for looking into the issue, I could reproduce the issue with the same code you tested.
Using google provider version 4.83.0 - Works fine
Using google provider version 5.0.0 - Fails at attached disk resource with "zone not provided" error


XXXXXXXX@XXXXXXXX manual % terraform init -upgrade

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/google-beta versions matching "~> 4.83.0"...
- Finding hashicorp/google versions matching "~> 4.83.0"...
- Installing hashicorp/google-beta v4.83.0...
- Installed hashicorp/google-beta v4.83.0 (signed by HashiCorp)
- Installing hashicorp/google v4.83.0...
- Installed hashicorp/google v4.83.0 (signed by HashiCorp)

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
i859246@N62FH6MXPK manual % terraform plan     

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_attached_disk.default will be created
  + resource "google_compute_attached_disk" "default" {
      + device_name = (known after apply)
      + disk        = (known after apply)
      + id          = (known after apply)
      + instance    = (known after apply)
      + mode        = "READ_WRITE"
      + project     = (known after apply)
      + zone        = (known after apply)
    }

  # google_compute_disk.default will be created
  + resource "google_compute_disk" "default" {
      + creation_timestamp        = (known after apply)
      + id                        = (known after apply)
      + image                     = "debian-11-bullseye-v20220719"
      + label_fingerprint         = (known after apply)
      + last_attach_timestamp     = (known after apply)
      + last_detach_timestamp     = (known after apply)
      + licenses                  = (known after apply)
      + name                      = "issue16265-disk"
      + physical_block_size_bytes = 4096
      + project                   = (known after apply)
      + provisioned_iops          = (known after apply)
      + provisioned_throughput    = (known after apply)
      + self_link                 = (known after apply)
      + size                      = (known after apply)
      + source_disk_id            = (known after apply)
      + source_image_id           = (known after apply)
      + source_snapshot_id        = (known after apply)
      + type                      = "pd-ssd"
      + users                     = (known after apply)
      + zone                      = "asia-northeast2-a"
    }

  # google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-medium"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "issue16265"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = "asia-northeast2-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-11"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
XXXXXX@XXXXX manual % terraform --version
Terraform v1.4.6
on darwin_arm64
+ provider registry.terraform.io/hashicorp/google v4.83.0
+ provider registry.terraform.io/hashicorp/google-beta v4.83.0

Your version of Terraform is out of date! The latest version
is 1.6.2. You can update by downloading from https://www.terraform.io/downloads.html
XXXXXXX@XXXXXX manual % vi main.tf 
XXXXXXX@XXXXXX manual % terraform init -upgrade

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/google versions matching "~> 5.0.0"...
- Finding hashicorp/google-beta versions matching "~> 5.0.0"...
- Installing hashicorp/google v5.0.0...
- Installed hashicorp/google v5.0.0 (signed by HashiCorp)
- Installing hashicorp/google-beta v5.0.0...
- Installed hashicorp/google-beta v5.0.0 (signed by HashiCorp)

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
i859246@N62FH6MXPK manual % terraform plan         

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # google_compute_disk.default will be created
  + resource "google_compute_disk" "default" {
      + creation_timestamp        = (known after apply)
      + effective_labels          = (known after apply)
      + id                        = (known after apply)
      + image                     = "debian-11-bullseye-v20220719"
      + label_fingerprint         = (known after apply)
      + last_attach_timestamp     = (known after apply)
      + last_detach_timestamp     = (known after apply)
      + licenses                  = (known after apply)
      + name                      = "issue16265-disk"
      + physical_block_size_bytes = 4096
      + project                   = "sap-hcm-pd51-shared"
      + provisioned_iops          = (known after apply)
      + provisioned_throughput    = (known after apply)
      + self_link                 = (known after apply)
      + size                      = (known after apply)
      + source_disk_id            = (known after apply)
      + source_image_id           = (known after apply)
      + source_snapshot_id        = (known after apply)
      + terraform_labels          = (known after apply)
      + type                      = "pd-ssd"
      + users                     = (known after apply)
      + zone                      = "asia-northeast2-a"
    }

  # google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + effective_labels     = (known after apply)
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-medium"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "issue16265"
      + project              = "sap-hcm-pd51-shared"
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + terraform_labels     = (known after apply)
      + zone                 = "asia-northeast2-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-11"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Error: 1 error occurred:
│ 	* Failed to retrieve zone, pid: , err: zone: required field is not set
│ 
│ 
│ 
│   with google_compute_attached_disk.default,
│   on main.tf line 6, in resource "google_compute_attached_disk" "default":
│    6: resource "google_compute_attached_disk" "default" {
│ 


╵XXXXX@XXXXX manual % terraform --version
Terraform v1.4.6
on darwin_arm64
+ provider registry.terraform.io/hashicorp/google v5.0.0
+ provider registry.terraform.io/hashicorp/google-beta v5.0.0

Your version of Terraform is out of date! The latest version
is 1.6.2. You can update by downloading from https://www.terraform.io/downloads.html



Code:
```
resource "google_compute_attached_disk" "default" {
  disk     = google_compute_disk.default.id
  instance = google_compute_instance.default.id
}

resource "google_compute_instance" "default" {
  name         = "issue16265"
  machine_type = "e2-medium"
  zone         = "asia-northeast2-a"

  boot_disk {
    initialize_params {
      image = "debian-cloud/debian-11"
    }
  }

  network_interface {
    network = "default"
  }

  lifecycle {
    ignore_changes = [attached_disk]
  }
}

resource "google_compute_disk" "default" {
  name  = "issue16265-disk"
  type  = "pd-ssd"
  zone  = "asia-northeast2-a"
  image = "debian-11-bullseye-v20220719"
  physical_block_size_bytes = 4096
}


terraform {
    required_providers {
        google = {
            version = "~> 5.0.0"
            #version = "~> 4.84.0"
            #version = "~> 4.80.0"
        }
        google-beta = {
            version = "~> 5.0.0"
            #version = "~> 4.84.0"
            #version = "~> 4.80.0"
        }
    }
}

```

Btw, this is the test code, in prod we are using instance template and instance from template which has similar error attaching disk